Tekla.Structures.Datatype.ValueList
Provides methods for working with generic value lists.

Tekla.Structures.Datatype.ValueList.ToString``1(System.Collections.Generic.IEnumerable{``0},Tekla.Structures.Datatype.ValueList.ToStringFunc{``0})
Converts a list of values into a string.
Value type.
values: Enumerable list of values.
toString: ToString function delegate.
Returns: Formatted string representation of the value list.

Tekla.Structures.Datatype.ValueList.Parse``1(System.String,Tekla.Structures.Datatype.ValueList.TryParseFunc{``0})
Parses a value list.
Value type.
input: Input string.
tryParse: TryParse function delegate.
Returns: Enumerable list of parsed values.

Tekla.Structures.Datatype.ValueList.separator
Value separator.

Tekla.Structures.Datatype.ValueList.multiplier
Value multiplier.